cases/multiphaseEjector/VOF/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          binary;
    arch            "LSB;label=32;scalar=64";
    class           volScalarField;
    location        "0";
    object          alpha.water;
}

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inletMain
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    inletSecondary
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    wallNozzle1
    {
        type            zeroGradient;
    }
    wallNozzle2
    {
        type            zeroGradient;
    }
    wallDiffuser
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
