cases/multiphaseEjector/VOF/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volScalarField;
    location        "0";
    object          epsilon;
}

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    inletMain
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength	0.003; // 3.8% of diameter
	value           uniform 1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    inletSecondary
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    wallNozzle1
    {
        type            epsilonWallFunction;
        blending        stepwise;
        value           uniform 1;
    }
    wallNozzle2
    {
        type            epsilonWallFunction;
        blending        stepwise;
        value           uniform 1;
    }
    wallDiffuser
    {
        type            epsilonWallFunction;
        blending        stepwise;
        value           uniform 1;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    walls
    {
        type            epsilonWallFunction;
        blending        stepwise;
        value           uniform 1;
    }
}


// ************************************************************************* //
