cases/multiphaseEjector/VOF/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water	1
);

regions
(
    boxToCell
    {
	box (0.132 0 -0.0015) (1.000 0.063 0.0015);
	fieldValues
        (
            volScalarFieldValue alpha.water	0
        );
    }
);


// ************************************************************************* //
